export default {
  projections: {
    ЗаказыE: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      типВручения: {
        __caption__: 'Тип вручения'
      },
      колво: {
        __caption__: 'Колво'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      клиенты: {
        __caption__: 'Клиенты',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      адрес: {
        __caption__: 'Адрес',
        город: {
          __caption__: 'Город'
        }
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      заказТапочек: {
        __caption__: 'Заказ тапочек',
        комментарий: {
          __caption__: 'Комментарий'
        },
        тапочки: {
          __caption__: 'Тапочки',
          наименование: {
            __caption__: 'Наименование'
          }
        }
      },
      заказСланцев: {
        __caption__: 'Заказ сланцев',
        комментарий: {
          __caption__: 'Комментарий'
        },
        сланцы: {
          __caption__: 'Сланцы',
          наименование: {
            __caption__: 'Наименование'
          }
        }
      }
    },
    ЗаказыL: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      типВручения: {
        __caption__: 'Тип вручения'
      },
      колво: {
        __caption__: 'Колво'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      клиенты: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      адрес: {
        __caption__: 'Город',
        город: {
          __caption__: 'Город'
        }
      },
      сотрудник: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    кодЗаказа: {
      __caption__: 'Код заказа'
    },
    колво: {
      __caption__: 'Колво'
    },
    комментарий: {
      __caption__: 'Комментарий'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    типВручения: {
      __caption__: 'Тип вручения'
    },
    типОплаты: {
      __caption__: 'Тип оплаты'
    },
    адрес: {
      __caption__: 'Адрес'
    },
    клиенты: {
      __caption__: 'Клиенты'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    },
    заказТапочек: {
      __caption__: 'Заказ тапочек'
    },
    заказСланцев: {
      __caption__: 'Заказ сланцев'
    }
  }
};
