export default {
  projections: {
    ХарТапочекE: {
      количество: {
        __caption__: 'Количество'
      },
      размер: {
        __caption__: 'Размер'
      },
      категория: {
        __caption__: 'Категория',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    количество: {
      __caption__: 'Количество'
    },
    размер: {
      __caption__: 'Размер'
    },
    категория: {
      __caption__: 'Категория'
    },
    тапочки: {
      __caption__: 'тапочки'
    }
  }
};
